nc: 6 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]

# backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, DFELDown, [128]] # 1-P2/4
  - [-1, 2, GhostSEC3, [256, True]]
  - [-1, 1, DFELDown, [256]] # 3-P3/8
  - [-1, 2, GhostSEC3, [512, True]]
  - [-1, 1, DFELDown, [512]] # 5-P4/16
  - [-1, 2, GhostSEC3, [512, True]]
  - [-1, 1, DFELDown, [1024]] # 7-P5/32
  - [-1, 2, GhostSEC3, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2CSModule, [1024]] # 10

# head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, GhostSEC3, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, GhostSEC3, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, GhostSEC3, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, GhostSEC3, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
